mekops-labs/telegraph-stm-fw/boards/hazk03-stm32f105rb/src/hazk03.h
/* SPDX-License-Identifier: Apache-2.0 */

#ifndef __BOARDS_ARM_STM32_HAZK03_STM32F105RB_SRC_HAZK03_H
#define __BOARDS_ARM_STM32_HAZK03_STM32F105RB_SRC_HAZK03_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stddef.h>
#include <stdint.h>

#include <nuttx/i2c/i2c_master.h>

#include "stm32_gpio.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Pin map of the display hardware.
 *
 * Note: the TM1629A drives the 7-segment clock digits. It uses a 3-wire
 * serial bus.
 */

#define GPIO_TM1629A_STB  (GPIO_OUTPUT | GPIO_CNF_OUTPP | GPIO_MODE_50MHz | \
                           GPIO_OUTPUT_SET | GPIO_PORTB | GPIO_PIN5)
#define GPIO_TM1629A_CLK  (GPIO_OUTPUT | GPIO_CNF_OUTPP | GPIO_MODE_50MHz | \
                           GPIO_OUTPUT_SET | GPIO_PORTB | GPIO_PIN3)
#define GPIO_TM1629A_DIO  (GPIO_OUTPUT | GPIO_CNF_OUTPP | GPIO_MODE_50MHz | \
                           GPIO_OUTPUT_SET | GPIO_PORTB | GPIO_PIN4)

/* SM1626D dot matrix. Both screens share the clock, the output-enable and the
 * strobe lines. Only the serial data input is different.
 */

#define GPIO_SM1626D_CLK  (GPIO_OUTPUT | GPIO_CNF_OUTPP | GPIO_MODE_50MHz | \
                           GPIO_OUTPUT_CLEAR | GPIO_PORTB | GPIO_PIN12)
#define GPIO_SM1626D_OE   (GPIO_OUTPUT | GPIO_CNF_OUTPP | GPIO_MODE_50MHz | \
                           GPIO_OUTPUT_SET | GPIO_PORTB | GPIO_PIN13)
#define GPIO_SM1626D_STB  (GPIO_OUTPUT | GPIO_CNF_OUTPP | GPIO_MODE_50MHz | \
                           GPIO_OUTPUT_CLEAR | GPIO_PORTB | GPIO_PIN14)
#define GPIO_SM1626D_DIN_MAIN \
                          (GPIO_OUTPUT | GPIO_CNF_OUTPP | GPIO_MODE_50MHz | \
                           GPIO_OUTPUT_CLEAR | GPIO_PORTB | GPIO_PIN15)

/* This is the data input of the sub-screen.
 *
 * Note: after a reset, PA13 is the SWDIO signal. Refer to the function
 * hazk03_jtag_reclaim() in the file stm32_bringup.c.
 */

#define GPIO_SM1626D_DIN_SUB \
                          (GPIO_OUTPUT | GPIO_CNF_OUTPP | GPIO_MODE_50MHz | \
                           GPIO_OUTPUT_CLEAR | GPIO_PORTA | GPIO_PIN13)

/* DS3231 RTC. The pins PC6 and PC7 have no connection to an I2C peripheral on
 * this part. Thus software drives the bus. Both lines are open-drain and use
 * the pull-up resistors on the board.
 */

#define GPIO_DS3231_SCL   (GPIO_OUTPUT | GPIO_CNF_OUTOD | GPIO_MODE_50MHz | \
                           GPIO_OUTPUT_SET | GPIO_PORTC | GPIO_PIN6)
#define GPIO_DS3231_SDA   (GPIO_OUTPUT | GPIO_CNF_OUTOD | GPIO_MODE_50MHz | \
                           GPIO_OUTPUT_SET | GPIO_PORTC | GPIO_PIN7)

/****************************************************************************
 * Public Function Prototypes
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_bringup
 *
 * Description:
 *   Do the initialisation for this board.
 *   Release the debug pins.
 *   Set every display line to a known state.
 *
 ****************************************************************************/

int stm32_bringup(void);

/****************************************************************************
 * Name: hazk03_display_init
 *
 * Description:
 *   Initialise the panels and the digits.
 *   Start the scan loop that keeps the panels on.
 *
 ****************************************************************************/

int hazk03_display_init(void);

/****************************************************************************
 * Name: hazk03_rtc_initialize
 *
 * Description:
 *   Start the software bus.
 *   Attach the DS3231 with the battery to that bus as the system RTC.
 *
 *   Note: the function returns the bus for the other registers of the device.
 *
 ****************************************************************************/

struct i2c_master_s *hazk03_rtc_initialize(void);

/* The two panels. */

#define HAZK03_PANEL_MAIN  0
#define HAZK03_PANEL_SUB   1

/****************************************************************************
 * Name: hazk03_display_text
 *
 * Description:
 *   Put a text on one panel. An empty text clears that panel.
 *
 *   Note: the function takes the lock of the framebuffer. Thus a scan pass
 *   never gives a partial image.
 *
 ****************************************************************************/

int hazk03_display_text(int panel, const char *s, size_t len);

/****************************************************************************
 * Name: hazk03_display_temperature
 *
 * Description:
 *   Give the last temperature of the DS3231, in tenths of a degree Celsius.
 *
 ****************************************************************************/

int16_t hazk03_display_temperature(void);

/****************************************************************************
 * Name: hazk03_ipc_init
 *
 * Description:
 *   Start the task that serves the protocol on the UART of the edge MCU.
 *
 *   Note: this UART also carries the serial console. Thus only a build
 *   without a console starts this task.
 *
 ****************************************************************************/

int hazk03_ipc_init(void);

#endif /* __BOARDS_ARM_STM32_HAZK03_STM32F105RB_SRC_HAZK03_H */
